#1
a = int(input("Введіть число а:"))
while a<100:
    a+=5
    print(a)
#2
a = int(input("Введіть число а:"))
b = int(input("Введіть число b:"))
while a!=b:
    b=int(input("Спробуйте ще раз вгадати число a"))

print("Ви вгадали число а =", a)
#3
a = 1000
print("Початковий внесок:", a)
n = int(input("Введіть кількість років:"))
c=0
while c<n:
    a*0.25
    c+=1
#4
a=int(input("Введіть число а:"))
n=int(input("Введіть число n:"))
c=0
while n>a:
    a+=5
    c+=a
print("Сума чисел від початкового а до n дорівнює:", c)
#5
a=int(input("Введіть факторіал:"))
while a>a+1:
    a*=a-1
print("Факторіал дорівнює:", a)